In [76]:
import pandas as pd
import numpy as np

In [31]:
df = pd.DataFrame([['A','A','A','B','B','C'],['PL','GL','HL','PL','PL','GL']]).transpose()

In [34]:
df.columns = ['User_ID','Loan_Type']

In [35]:
df

  User_ID Loan_Type
0       A        PL
1       A        GL
2       A        HL
3       B        PL
4       B        PL
5       C        GL

In [77]:
df['PL_Flag']=np.where(df['Loan_Type']=='PL',1,0)
df['HL_Flag']=np.where(df['Loan_Type']=='HL',1,0)
df['GL_Flag']=np.where(df['Loan_Type']=='GL',1,0)

In [81]:
df

  User_ID Loan_Type  PL_Flag  HL_Flag  GL_Flag
0       A        PL        1        0        0
1       A        GL        0        0        1
2       A        HL        0        1        0
3       B        PL        1        0        0
4       B        PL        1        0        0
5       C        GL        0        0        1

In [86]:
gg= df.groupby(['User_ID']).agg({'PL_Flag':'max','HL_Flag':'max','GL_Flag':'min'}).reset_index()

In [87]:
gg

  User_ID  PL_Flag  HL_Flag  GL_Flag
0       A        1        1        0
1       B        1        0        0
2       C        0        0        1

In [60]:
gg = df.groupby(['User_ID','Loan_Type']).agg({'User_ID':'count'})

In [68]:
gg = df.groupby(['User_ID','Loan_Type']).agg({'User_ID':'count'})

In [69]:
gg.columns = ['Cnt']

In [70]:
gg

                   Cnt
User_ID Loan_Type
A       GL           1
        HL           1
        PL           1
B       PL           2
C       GL           1

In [74]:
gg.groupby(['User_ID']).agg({'Cnt':'sum'})

         Cnt
User_ID
A          3
B          2
C          1

In [49]:
#df.groupby(['User_ID','Loan_Type']).agg('count').reset_index()

In [53]:
type(gg)

pandas.core.frame.DataFrame

In [56]:
gg.index

MultiIndex([('A', 'GL'),
            ('A', 'HL'),
            ('A', 'PL'),
            ('B', 'PL'),
            ('C', 'GL')],
           names=['User_ID', 'Loan_Type'])

In [57]:
gg.columns

Index(['User_ID'], dtype='object')